In [10]:
import numpy as np
import pandas as pd

In [130]:
df = pd.read_csv('./data/train.csv')

In [115]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [157]:
single_3c_f=(df['Pclass']==3) & (df['Sex']=='female') & (df['SibSp']==0) & (df['Parch']==0)
single_3c_f.head(5)

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [162]:
single_3c_m=(df['Pclass']==3) & (df['Sex']=='male') & (df['SibSp']==0) & (df['Parch']==0)
single_3c_m.head(5)

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [163]:
single_3c_m_nan=(df['Pclass']==3) & (df['Sex']=='male') & (df['SibSp']==0) & (df['Parch']==0) &  (df['Age'].isnull())
single_3c_m_nan.head(5)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [164]:
single_3c_f_nan=(df['Pclass']==3) & (df['Sex']=='female') & (df['SibSp']==0) & (df['Parch']==0) &  (df['Age'].isnull())
single_3c_f_nan.head(5)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [182]:
single_3c_female_mean_age = df[bool_single_3c_f]['Age'].mean()
single_3c_female_mean_age

23.56578947368421

In [165]:
single_3c_male_mean_age = df[bool_single_3c_m]['Age'].mean()
single_3c_male_mean_age

29.184491978609625

In [181]:
df.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S